Revit 2027 API
FamilyType.AsInteger Method
Provides access to the integer number of the given family parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int? AsInteger(
	FamilyParameter familyParameter
)
Public Function AsInteger (
	familyParameter As FamilyParameter
) As Integer?
public:
Nullable<int> AsInteger(
	FamilyParameter^ familyParameter
)
member AsInteger :
        familyParameter : FamilyParameter -> Nullable<int>
Parameters
familyParameter FamilyParameter
Return Value
Nullable<Int32>
The integer value contained in the parameter. Returns null if the storage type of the input argument is not integer type or this parameter has no value.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument-"familyParameter"-is null.
ArgumentException |  Thrown if the input argument-"familyParameter"-is invalid,
See Also
Reference
FamilyType Class
Autodesk.Revit.DB Namespace